{
  "id": "faq",
  "content": "## Registration\n\n### How can I buy tickets?\nWe have a very unique process of selling tickets to our Conference. To get a ticket you will have to make a small donation to a charity via our auctions on [Allegro](https://allegro.pl/uzytkownik/ConfituraPL). \n\n### Can I give someone my ticket or voucher?\nYes. You can pass your ticket to anyone you like, but only either for free or up to the price you have paid for it.\n\n### How much will the ticket cost?\nWe have not decided this yet. But it should not be very different from last year's 50 PLN (~ 11 EUR)\n\n### When will you start selling the tickets?\nTraditionally we start auctions at the turn of May and June. This edition should be no different.\n\n### Can I buy multiple tickets?\nYes, you can.\n\n### Can I get an invoice?\nNo. If you \"buy\" the ticket it's actually a donation directly to charity and you can book it as one.\n\n### I have missed a registration process, can I attend the conference?\nSorry, but it is impossible. If you are interested in Confitura talks, you can watch presentations later on our youtube channel.\n\n### But I really, really, really want to attend the conference. Can I??\nSorry, but still no...\n\n### I have bought the ticket, but I didn't get any email with registration link.\nImporting users who paid for their tickets from allegro to Jelatyna (our system) is a manual process. You should get an email up to a week after paying for your ticket.\n\nThis year we use Allegro API to send registration Vouchers so check messages on the platform.\n\n### When will I get my e-ticket?\ne-tickets, in form of QR codes, will be e-mailed to you around a week before the conference.\n\n### What if I didn't get registration email/e-ticket ?\nDrop us a message about it : confitura@confitura.pl\n\n## Call 4 Papers\n\n### When are you going to open Call 4 Papers.\nAround beginning of April.\n\n### And how long is it going to be?\nAround a month.\n\n### How much time do I have for my presentation?\nPresentations are 45 minutes long. Including q'n'a session.\n\n### When will I know if my talk has been accepted?\nWe will publish C4P results around mid-May.\n\n### I have reported multiple talks, is it possible that more than one will be accepted?\nOur rule of thumb is to accept at most one presentation from each speaker.\n\n## Vote 4 Papers\n\n### What is this whole Vote 4 Papers process?\nAfter you submit the presentation it will be exposed publicly. Everyone will be able to vote on your presentation either that he/she is interested in it (+1), not interested at all(-1), or just don't care (0). Result of V4P will be an input for the decision made by the Confitura committee. \nVote 4 Papers is one of our Trade Marks, and we are proud of it :)\n\n### There are a lot of talks reported. For sure some not everyone will go through the whole list. How do you make sure that each presentation gets equal number of votes?\nWe are aware of this problem. To deal with it we are randomizing the order of presentations for each voter. In our experience it helps a lot.\n\n## Conference day\n\n### What time should I come?\nRegistration is open from 8 a.m. In the venue you can enjoy your morning coffee or tea and grab a sandwich, so you can join us very early in the morning :)\n\n### What if I am late for the conference?\nNo worries, registration is open all day, you can register anytime.\n\n### Can I attend other presentations than those marked as preferred?\nYes, that information was very helpful for us (planning etc.), but you can attend every talk you want to.\n\n### What should I bring to a registration desk?\nYou need to have your e-ticket (QR code) with you. It can be printed or just presented on a screen (phone, tablet, laptop - we don't care).\n\n### There are 4 different tracks, how to choose right talk?\nYeah, we know that it is hard to decide :) If you're not sure, check out briefs of presentations, discuss the issue with others (there so many networking options!). All presentations will be recorded. They will be available on our  [youtube channel](https://www.youtube.com/confiturapl).\n\n### Will the talks be recorded?\nYes, all talks will be recorded and available on our [youtube channel](https://www.youtube.com/confiturapl).\n\n### Is there any mobile app for Confitura participants?\nWe used to have mobile app, but this year we have decided to deliver all that functionality (and more) on our website. And yes - it will be available offline.\n\n## Venue\n### How to get to the conference venue?\nDetails are available [online](https://confitura.pl/venue)  \n\n### Is it possible to park a car at the venue?\nCar park next to Conference Centre can hold 100 of cars (please be aware that you will be charged for that). Another possibility is to park on the street.\n\n[//]: # (### Do I have pay for a lunch?)\n[//]: # (No, at lunch break you can enjoy a light meal served in the venue. Yes if you go out to have a burger in a restaurant nearby :)\n\n### Is there any WiFi available?\nIt is extremely difficult to provide reliable WiFi connection for such a big crowd. We don't want you to be annoyed due to constantly loosing connection. That's why we have decided not to provide wireless connection during Confitura and focus time saved on other aspects of the conference. \n\n## SPOINa\n\n### Can everyone join an afterparty (SPOINa)?\nUnfortunately no. Spots are limited, but you can win an invitation by taking part in Q&amp;A sessions after presentations or by having a chat with organizers.\n\n### Is there any dress code required at SPOINa?\nOther than \"dressed\" - no :)\n\n### So what does SPOINa mean anyway?\nIt is an acronym of polish words \"SPOtkanie INtegracyjne\" (eng. integration meeting). Spoina itself also means \"joint\" - so it fits very nicely :) Credit goes to [Jacek Laskowski](https://twitter.com/jaceklaskowski) - founder of Confitura (which at that time was called Javarsovia)\n\n## After conference\n\n### When are you going to publish recordings on your youtube account?\nAfter the recordings of all of them will be processed. Probably ~3 months.\n\n### Are you providing slides for download?\nWe don't collect them so you should contact speakers directly (or check their twitter, sometimes they post it there).\n\n\n## GDPR and social account\n\n### if you want to remove your data send an email to confitura@confitura.pl",
  "_links": {
    "self": {
      "href": "https://2023.confitura.pl/api/pages/faq"
    },
    "page": {
      "href": "https://2023.confitura.pl/api/pages/faq"
    }
  }
}