{
  "id": "lean-coffee",
  "content": "<!-- Yay, no errors, warnings, or alerts! -->\n\nLean coffee i troika consulting to techniki dzielenia się wiedzą i rozwiązywania problemów. Przyjdź na ścieżkę lean coffee, żeby je poznać i przećwiczyć w praktyce. Wspólnie z innymi uczestnikami połączymy się w grupy i spróbujemy rozwiązać konkretne problemy. Dzięki temu na własnej skórze przekonasz się czy te techniki faktycznie są tak przydatne, nauczysz się czegoś nowego i poznasz się z innymi uczestnikami konferencji.\n\n\n### ZBIERANIE TEMATÓW\n\nŻebyśmy mieli na czym pracować, musimy pozyskać pomysły problemów do rozwiązania i tematów do konsultowania. Przyjdź do sali Lean Coffee w drugiej połowie przerwy obiadowej. Nasi trenerzy zapoznają Cię z zasadami i wyjaśnią ogólne reguły metodyk lean coffee i troika consulting. Możesz wtedy zgłosić swój pomysł do przepracowania lub zagłosować na temat kogoś innego. Wtedy też podzielimy się na grupy i przypiszemy do slotów czasowych podczas których będziemy pracować. Mamy 5 sesji po 30 minut. Wtedy też zdecydujesz czy chcesz wziąć udział w dyskusji lean coffee czy troika consulting. Mamy miejsce na 4 grupy troika consulting i 2 grupy lean coffee w trakcie każdej sesji.\n\n\n### SESJE\n\nPrzyjdź z lekkim wyprzedzeniem na sesję na którą się zgłosiłeś/aś. Jeśli nie wyrobiłeś/aś się na zbieranie tematów, to wpadnij i rozejrzyj się czy jakiś slot nie czeka jeszcze na chętnych uczestników. Równolegle do trwających dyskusji zawsze możesz dodać nowy temat, lub zarezerwować miejsce na wolnej sesji.\n\nW trakcie sesji nasi trenerzy będą Was wspierali i udzielali wskazówek.\n\n\n### RETROSPEKTYWA\n\nNa samym końcu odbędzie się retrospektywa. Chcemy dostać od Was jak najwięcej feedbacku, żeby nasze warsztaty stawały się za każdym razem lepsze. Będzie nam bardzo miło jeśli wpadniesz i podzielisz się odczuciami i sugestiami.\n\n\n### AGENDA\n\n\n\n* `13:30 - 14:00: Zbieranie tematów i przypisywanie się do grup`\n* `14:00 - 14:30: Sesja I`\n* `14:30 - 15:00: Sesja II`\n* `15:05 - 15:35: Sesja III`\n* `15:35 - 16:05: Sesja IV`\n* `16:10 - 16:40: Sesja V`\n* `16:40 - 17:10: Retrospektywa`\n\n\n### JAK SIĘ PRZYGOTOWAĆ?\n\nZadbaliśmy o to, by na miejscu były wszystkie potrzebne artykuły biurowe. Przynieś tylko swoje pomysły oraz chęć do nauki i współpracy!\n\n\n### PRZYKŁADOWE TEMATY\n\n\n\n* <strong><code>(Lean Coffee) Jak budować relacje interpersonalne w pracy i poza nią?</code></strong>\n* <strong><code>(Lean Coffee) Czysta architektura, a pragmatyzm - gdzie postawić granicę jakości? </code></strong>\n* <strong><code>(Lean Coffee) Jak migrować systemy legacy na cloud? </code></strong>\n* <strong><code>(Troika Consulting) Jak zagwarantować kolejność i idempotentność eventów w moim projekcie?</code></strong>\n* <strong><code>(Troika Consulting) Moje query w mongo jest za wolne, czy da się je jeszcze przyspieszyć? </code></strong>\n* <strong><code>(Troika Consulting) Muszę zebrać wymagania do dużego projektu, jak mogę to zrobić najwydajniej?</code></strong>\n\n",
  "_links": {
    "self": {
      "href": "https://2023.confitura.pl/api/pages/lean-coffee"
    },
    "page": {
      "href": "https://2023.confitura.pl/api/pages/lean-coffee"
    }
  }
}