{
  "level" : "intermediate",
  "shortDescription" : "Opowiem Ci swoją historię założenia, rozwoju i sprzedaży dwóch firm (i przejęcia lub zainwestowania w kilka innych), czego się z tego nauczyłem i w jaki sposób diametralnie zmieniło się moje pierwotne postrzeganie \"niezbędnej wcześniejszej emerytury software developera\".",
  "tags" : [ ],
  "description" : "Jeśli podobnie jak ja sądziliście w młodym wieku (albo studenckim/młodzieńczym), że trzeba zarobić kupę kasiory do czterdziestki czy czterdziestki piątki (wersja dla pesymistów), bo potem jako starzejący się software developerzy będziecie niewiele już warci na szybko zmieniającym się rynku IT, a zarobić to można najwięcej przez zbudowanie i sprzedaż firmy IT, to ta prezentacja jest dla Was. Kiedyś jeszcze mieszkając w komunie studenckiej snułem z kumplami plany, że do 42 roku życia to będziemy już na zasłużonej emeryturze. Ja nie zdążyłem sprzedać firmy do tego wieku, natomiast zrobiłem to w wieku 44 lat. I w sumie dobrze, że później...\nOpowiem Ci swoją historię założenia, rozwoju i sprzedaży dwóch firm (i przejęcia lub zainwestowania w kilka innych), czego się z tego nauczyłem i w jaki sposób diametralnie zmieniło się moje pierwotne postrzeganie \"niezbędnej wcześniejszej emerytury software developera\". ",
  "title" : "Sprzedawanie własnego biznesu IT - jak nie wtopić i co potem",
  "status" : "accepted",
  "workshop" : false,
  "speakers" : [ {
    "id" : "b443ab41-43fa-45a0-96bc-4ae4db51ecf2",
    "name" : "Wojciech Seliga",
    "bio" : "Zacząłem programować prawie 40 lat temu, jak miałem jakieś 6 czy 7 lat. Widziałem przez te lata różne technologie, metodologie, trendy, mody, buzzwordy. Pokochałem C++, ale większość życia programistycznego kodowałem w Javie.\nOd prawie 20 lat krzewię ideały i praktyki metodologii zwinnych, a przede wszystkim otwartość i uczciwość we wszystkich relacjach.\nW 2007 roku założyłem z kolegami Spartez, która po latach rozrosła się we dwie firmy – software house obsługujący przede wszystkim Atlassiana i osobną firmę produktową z kilkoma tysiącami klientów z całego świata. Przez wiele lat byłem ich CEO. Zatrudnialiśmy ponad 250 fantastycznych osób z kilkunastu krajów świata i wszystkich kontynentów, razem stworzyliśmy dużo dobrych produktów.\nW latach 2020 – 2021 sprzedaliśmy obie firmy. Teraz więcej odpoczywam, spędzam sporo czasu z rodziną, uprawiam sport (tenis, narty, rower), inwestuję (także sporo poza IT), buduję (fizycznie), doradzam oraz nadal staram się dzielić wiedzą.\n \nPrezentowałem na wielu uznanych, a także mniej znanych eventach w Polsce i za granicą: np. Devoxx, Agile, Agile EE, Confitura, GeeCon, InfoSHARE, Atlassian Summit, Atlascamp, COOLuary, JUGi, JDD, itd.",
    "twitter" : "wseliga",
    "github" : null,
    "www" : null,
    "photo" : "https://www.gravatar.com/avatar/d998f46456336526118740b5e7f658df.jpg?s=300&d=blank"
  } ],
  "language" : "pl",
  "id" : "eccc46ae-522e-478f-b4e6-c626f713e844",
  "_links" : {
    "self" : {
      "href" : "https://2023.confitura.pl/api/presentations/eccc46ae-522e-478f-b4e6-c626f713e844"
    },
    "presentation" : {
      "href" : "https://2023.confitura.pl/api/presentations/eccc46ae-522e-478f-b4e6-c626f713e844{?projection}",
      "templated" : true
    },
    "tags" : {
      "href" : "https://2023.confitura.pl/api/presentations/eccc46ae-522e-478f-b4e6-c626f713e844/tags"
    },
    "speakers" : {
      "href" : "https://2023.confitura.pl/api/presentations/eccc46ae-522e-478f-b4e6-c626f713e844/speakers{?projection}",
      "templated" : true
    },
    "ratings" : {
      "href" : "https://2023.confitura.pl/api/presentations/eccc46ae-522e-478f-b4e6-c626f713e844/ratings"
    }
  }
}