{
  "level" : "intermediate",
  "shortDescription" : "Why processing medical data could be challenging ? How much healthcare data differs from other market sectors ? How data privacy affects our work ? Is your own medical history safe with us ? Come and get answers to these and many other questions from IQVIA - healthcare IT industry leader.",
  "tags" : [ {
    "id" : "security",
    "name" : "Security"
  }, {
    "id" : "algorithms",
    "name" : "Algorithms"
  }, {
    "id" : "bigdata",
    "name" : "Big Data"
  }, {
    "id" : "sc",
    "name" : "Software Craftsmanship"
  } ],
  "description" : "In this presentation I will present challenges every company will face when processing medical data, e.g. data supplier agreements / data security / data (re)identification risks. I will also explain how medical data differs from other market sectors, e.g. multi-fact-based, data regulations (GDPR/HIPAA), wide selection of data dictionaries.\n\nIQVIA is by far a leader in healthcare data IT industry. We do not represent any pharmaceutical or medical institution - we are independent company focused on medical data aggregation & analytics. We have offices in 100+ countries around the world. In this presentation I will summarize the experience in data processing I acquired working for IQVIA almost 10 years now as solution architect for medical data analytical platform(s).",
  "title" : "What it takes to process healthcare data ?",
  "status" : "accepted",
  "workshop" : false,
  "speakers" : [ {
    "id" : "ab278e7c-e59a-4b6d-8c19-6a66e239f51f",
    "name" : "Piotr Kaczor",
    "bio" : "Piotr, Senior Technical Architect, IQVIA, has around 15 years experience in data warehousing. For the past 8 years Piotr remains responsible for end-to-end healthcare data warehouse design for local IQVIA teams around the world. Before IQVIA switched entirely to BigData in 2016, he was involved in data onboarding, curation & reporting processes on IBM PureData for Analytics (Netezza) technology. He originated from Oracle, had a chance to work with Teradata as well. Currently helping to transition Electronic Medical Records data solutions towards the cloud (DataBricks and/or SnowFlake). Personally more data-oriented, less interested in deep-programming topics.",
    "twitter" : null,
    "github" : null,
    "www" : null,
    "photo" : "/api/resources//photos/ab278e7c-e59a-4b6d-8c19-6a66e239f51f.jpg"
  } ],
  "language" : "en",
  "id" : "1d4d3f62-0fe2-4e12-8985-48df80fb592f",
  "_links" : {
    "self" : {
      "href" : "https://2023.confitura.pl/api/presentations/1d4d3f62-0fe2-4e12-8985-48df80fb592f"
    },
    "presentation" : {
      "href" : "https://2023.confitura.pl/api/presentations/1d4d3f62-0fe2-4e12-8985-48df80fb592f{?projection}",
      "templated" : true
    },
    "tags" : {
      "href" : "https://2023.confitura.pl/api/presentations/1d4d3f62-0fe2-4e12-8985-48df80fb592f/tags"
    },
    "speakers" : {
      "href" : "https://2023.confitura.pl/api/presentations/1d4d3f62-0fe2-4e12-8985-48df80fb592f/speakers{?projection}",
      "templated" : true
    },
    "ratings" : {
      "href" : "https://2023.confitura.pl/api/presentations/1d4d3f62-0fe2-4e12-8985-48df80fb592f/ratings"
    }
  }
}